Tekla Open API Reference for Tekla Structures 2025
AnalysisPartCompositeProperties.CompositeBeamEnum Enumeration
 The composite beam options.
 Namespace: Tekla.Structures.Analysis
 Assembly: Tekla.Structures.Analysis (in Tekla.Structures.Analysis.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public enum CompositeBeamEnum
Public Enumeration CompositeBeamEnum
Members
Member name | Value | Description
COMPOSITE_BEAM_NOT | 0 |  The composite beam setting "not".
COMPOSITE_BEAM_YES | 1 |  The composite beam setting "yes".
COMPOSITE_BEAM_AUTOMATIC | 2 |  The composite beam setting "automatic".
See Also
Reference
Tekla.Structures.Analysis Namespace